############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
def unique_count(items):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - items: 값이 담긴 리스트(중복 포함 가능)
    pass


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(unique_count([1, 2, 2, 3, 3, 3]))  # 3
print(unique_count(['a', 'b', 'a', 'c']))  # 3
print(unique_count([5, 5, 5, 5]))  # 1
print(unique_count([]))  # 0
#####################################################
