############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
# 세트의 차집합(- 또는 difference)을 활용하면 편하다
def only_in_first(list1, list2):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - list1, list2: 값이 담긴 리스트
    pass


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(only_in_first([1, 2, 3, 4, 5], [2, 4]))  # [1, 3, 5]
print(only_in_first(['a', 'b', 'c'], ['b']))  # ['a', 'c']
print(only_in_first([1, 2, 3], [1, 2, 3]))  # []
print(only_in_first([7, 7, 8, 9], [9]))  # [7, 8]
#####################################################
