############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
# Python 내장 함수 sum 을 사용하지 않으면 추가 점수
def sum_list(numbers):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - numbers: 정수로 이루어진 리스트
    total = 0
    for number in numbers:
        total += number
    return total


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(sum_list([10, 20, 30]))  # 60
print(sum_list([0, 0, 0]))  # 0
print(sum_list([5, 15, 25, 55]))  # 100
print(sum_list([100]))  # 100
#####################################################
