############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
# user_id[:3] 슬라이싱과 '*' * 개수 를 조합해 보라
def mask_id(user_id):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - user_id: 문자열
    pass


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(mask_id('jungssafy'))  # jun******
print(mask_id('kimssafy'))  # kim*****
print(mask_id('abc'))  # abc
print(mask_id('ab'))  # ab
#####################################################
