############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
def count_high(scores):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - scores: 시험 점수(정수) 리스트
    count = 0
    for score in scores:
        if score >= 90:
            count += 1
    return count



# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(count_high([90, 60, 95, 88]))  # 2
print(count_high([100, 90, 90]))  # 3
print(count_high([10, 20, 30]))  # 0
print(count_high([89, 91, 90, 45]))  # 2
#####################################################
