############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
# 슬라이싱을 이용해 뒤집은 문자열과 비교하면 간단하다
def is_palindrome(word):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - word: 문자열
    pass


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(is_palindrome('level'))  # True
print(is_palindrome('python'))  # False
print(is_palindrome('noon'))  # True
print(is_palindrome('a'))  # True
#####################################################
