############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
# 문자열 메서드 count 를 사용하지 않으면 추가 점수
def count_char(word, target):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - word: 문자열 / target: 세고 싶은 한 글자(문자열)
    pass


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(count_char('banana', 'a'))  # 3
print(count_char('banana', 'b'))  # 1
print(count_char('ssafy', 's'))  # 2
print(count_char('python', 'z'))  # 0
#####################################################
