############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
# 슬라이싱의 세 번째 값(스텝)을 활용하면 한 줄로 해결할 수 있다
def get_every_other(word):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - word: 문자열
    pass


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(get_every_other('python'))  # pto
print(get_every_other('ssafy'))  # say
print(get_every_other('abcdefg'))  # aceg
print(get_every_other('a'))  # a
#####################################################
