############## 주의 ##############
# 입력을 받기 위한 input 함수는 절대 사용하지 않습니다.
def group_by_length(words):
    # 여기에 코드를 작성하여 함수를 완성합니다.
    # 입력 - words: 단어(str) 리스트
    pass


# 추가 테스트를 위한 코드 작성 가능
# 예) print(함수명(인자))

#####################################################
# 아래 코드를 삭제하는 경우
# 모든 책임은 삭제한 본인에게 있습니다.
############## 테스트 코드 삭제 금지 #################
print(group_by_length(['sky', 'sea', 'tree', 'a', 'go']))  # {3: ['sky', 'sea'], 4: ['tree'], 1: ['a'], 2: ['go']}
print(group_by_length(['cat', 'dog', 'bird']))  # {3: ['cat', 'dog'], 4: ['bird']}
print(group_by_length(['one']))  # {3: ['one']}
print(group_by_length([]))  # {}
#####################################################
